open-vela/contest2026_272_tokenwujixian/chips/bk7258/audio/bk7258_dac.c
/****************************************************************************
 * chips/bk7258/audio/bk7258_dac.c
 *
 * BK7258 internal-DAC register-level HAL.  The public API is documented in
 * bk7258_dac.h; every ordering constraint, magic value and delay in this
 * file is traceable to a numbered step in
 * chips/bk7258/audio/BK7258_DAC_INIT_SEQUENCE.md.
 *
 * Derived from Apache-2.0 code in bk_avdk_smp/:
 *   - middleware/driver/audio/aud/aud_common_driver.c
 *   - middleware/driver/audio/aud/aud_dac_driver.c
 *   - middleware/soc/bk7258_ap/hal/sys_hal.c
 *   - middleware/soc/bk7258_ap/hal/sys_ll.h
 *   - middleware/soc/bk7258_ap/hal/aud_ll_macro_def.h
 ****************************************************************************/

#include <nuttx/config.h>

#include <debug.h>
#include <errno.h>
#include <stdbool.h>
#include <stdint.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/spinlock.h>

#include "arm_internal.h"
#include "bk7258_internal.h"

#include "bk7258_aud_reg.h"
#include "bk7258_dac.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Pre-computed ana_reg default values.  AVDK ships equivalent field-by-field
 * builders (aud_common_driver.c:153..291).  The hex constants below are the
 * comments AVDK itself left in place for reference, and match the runtime
 * value_cal() output field-for-field on BK7258 (SOC_BK7236XX branch).
 */

#define BK7258_ANA_REG18_DEFAULT      UINT32_C(0x00BF8085)
#define BK7258_ANA_REG19_DEFAULT      UINT32_C(0x81800006)
#define BK7258_ANA_REG20_DEFAULT      UINT32_C(0xFBC02423)
#define BK7258_ANA_REG21_DEFAULT      UINT32_C(0x00500000)
#define BK7258_ANA_REG27_DEFAULT      UINT32_C(0x91800006)

/* Analog-reg indices used by the DAC path.
 *
 * These are the AVDK "ana_reg N" logical register numbers, which are also
 * the word OFFSET from ana_reg0 (SYS_ANA_REG0_ADDR = SOC_SYS_REG_BASE +
 * (0x40<<2)).  AVDK addresses e.g. ana_reg5 at SOC_SYS_REG_BASE + (0x45<<2)
 * = reg0 + (5<<2); so BK7258_SYS_ANA_REG(n) = (reg0 base) + n*4 with
 * BK7258_SYS_ANALOG_REG_BASE already pointing at reg0 (word 0x40) gives the
 * correct physical address when n is the logical number (5, not 0x45).
 *
 * The same n is the SYS_ANALOG_REG_SPI_STATE busy bit number
 * (vendor: SYS_ANALOG_REG_SPI_STATE_POS(idx) = idx where idx is the
 * reg0-relative word offset), so bk7258_ana_reg_write()'s "1 << idx"
 * busy-wait matches vendor.  Passing the absolute word index (0x45 etc.)
 * here is WRONG — it double-counts the reg0 offset and writes 0x100 bytes
 * past the real register (verified: all ana_reg read back 0 in -F).
 */
#define BK7258_ANA_REG_APLL_PWD       5    /* AVDK "ana_reg5", pwdaudpll bit 13. */
#define BK7258_ANA_REG18              18
#define BK7258_ANA_REG19              19
#define BK7258_ANA_REG20              20
#define BK7258_ANA_REG21              21
#define BK7258_ANA_REG25_APLL_CFG     25
#define BK7258_ANA_REG26_APLL_CAL     26
#define BK7258_ANA_REG27              27

/* ana_reg20 bit positions we RMW at runtime.  All widths are 1 bit unless
 * annotated.  Values traced from sys_ll.h.
 */

#define ANA_REG20_DACDRVEN_BIT        19
#define ANA_REG20_DACLEN_BIT          21
#define ANA_REG20_DACG_BIT            22    /* 4-bit field.                */
#define ANA_REG20_DACG_MASK           0xFu
#define ANA_REG20_DACMUTE_BIT         26
#define ANA_REG20_DIFFEN_BIT          13
#define ANA_REG20_LENDCOC_BIT         16

/* ana_reg21 bit positions. */

#define ANA_REG21_ENIDACL_BIT         18
#define ANA_REG21_ENBS_BIT            23  /* sys_reg.h: SYS_ANA_REG21_ENBS_POS */

/* ana_reg18 bit positions. */

#define ANA_REG18_ENAUDBIAS_BIT       3

/* ana_reg5[13] = pwdaudpll (active-high power-DOWN). */

#define ANA_REG5_PWDAUDPLL_BIT        13

/* ana_reg25[18] = APLL SPI trigger. */

#define ANA_REG25_SPI_TRIGGER_BIT     18

/* Sys ctrl (0x44010000) register offsets used at runtime. */

/* Sys ctrl register bit positions taken from the AVDK sys_struct.h layout
 * for BK7258 (bk_avdk_smp/ap/middleware/soc/bk7258_ap/soc/sys_struct.h).
 */

#define SYS_CLK_DIV_MODE1             (BK7258_SYS_BASE + (0x8u * 4u))
#define   SYS_CLK_DIV_MODE1_CKSEL_AUD_BIT   25  /* sys_struct.h:144 */
#define   SYS_CLK_DIV_MODE1_CKSEL_AUD_MASK  0x1u

#define SYS_CLK_DIV_MODE2             (BK7258_SYS_BASE + (0x9u * 4u))
#define   SYS_CLK_DIV_MODE2_DMIC_DIV_BIT    13  /* sys_struct.h:163 */

#define SYS_CPU_DEVICE_CLK_EN         (BK7258_SYS_BASE + (0xCu * 4u))
#define   SYS_CPU_DEVICE_CLK_AUD_CKEN_BIT   30  /* sys_struct.h:238 */

/****************************************************************************
 * Private Data
 ****************************************************************************/

static bool           g_bk7258_aud_subsys_ready;
static bool           g_bk7258_dac_configured;
static spinlock_t     g_bk7258_aud_lock = SP_UNLOCKED;

/* Cached configuration so bk7258_dac_set_sample_rate() can honour the APLL
 * cal-value swap for the 44.1k family.
 */

static bool           g_bk7258_dac_use_apll;

/****************************************************************************
 * Private Helpers
 ****************************************************************************/

/* Read-modify-write on a plain sys-ctrl register (no analog SPI).  A single
 * putreg32 is enough because the whole SoC AHB slave is coherent from the
 * CPU.  Called from init only; no interlock with IRQ paths.
 */

static inline void bk7258_sys_reg_bits(uint32_t addr, uint32_t mask,
                                       uint32_t value)
{
  uint32_t v = getreg32(addr);
  v &= ~mask;
  v |= (value & mask);
  putreg32(v, addr);
}

/* Analog-register write, mirrors sys_ll_set_analog_reg_value():
 *   REG_WRITE(addr, value);
 *   spin until SPI_STATE bit[idx] clears.
 *
 * The SPI transfer takes only a handful of AHB cycles; AVDK does not bound
 * the wait.  We keep a generous 1000-iteration cap so a stuck bus surfaces
 * as an error rather than a lock-up.
 */

static int bk7258_ana_reg_write(uint32_t idx, uint32_t value)
{
  const uint32_t addr = BK7258_SYS_ANA_REG(idx);
  int loops = 1000;

  putreg32(value, addr);

  while ((getreg32(BK7258_SYS_ANA_SPI_STATE) & (UINT32_C(1) << idx)) != 0)
    {
      if (--loops <= 0)
        {
          auderr("BK7258: analog reg %lu SPI wait timeout\n",
                 (unsigned long)idx);
          return -ETIMEDOUT;
        }
    }

  return OK;
}

/* Read-modify-write on an analog register bit (equivalent to
 * sys_set_ana_reg_bit() in AVDK sys_ll.h).
 */

static int bk7258_ana_reg_bit(uint32_t idx, uint32_t pos, uint32_t mask,
                              uint32_t value)
{
  const uint32_t addr = BK7258_SYS_ANA_REG(idx);
  uint32_t v = getreg32(addr);

  v &= ~(mask << pos);
  v |= ((value & mask) << pos);
  return bk7258_ana_reg_write(idx, v);
}

/* One-shot APLL bring-up (spec §2.2).  cal_val is the family-specific cal
 * word; caller decides based on sample rate.
 */

static int bk7258_apll_program(uint32_t cal_val)
{
  int ret;

