open-vela/contest2026_272_tokenwujixian/chips/bk7258/audio/bk7258_dac.c
  /* Clear the "power-down APLL" bit — active-high in ana_reg5[13]. */

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG_APLL_PWD,
                           ANA_REG5_PWDAUDPLL_BIT, 0x1u, 0);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_ana_reg_write(BK7258_ANA_REG26_APLL_CAL, cal_val);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_ana_reg_write(BK7258_ANA_REG25_APLL_CFG,
                             BK7258_APLL_CONFIG_VAL);
  if (ret < 0)
    {
      return ret;
    }

  /* SPI trigger pulse.  AVDK loops delay(10); we use 200 us as a
   * conservative equivalent while APLL locks.
   */

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG25_APLL_CFG,
                           ANA_REG25_SPI_TRIGGER_BIT, 0x1u, 1);
  if (ret < 0)
    {
      return ret;
    }

  /* AVDK loops delay(10) here (approximately 10 ms on their RTOS tick).
   * Waiting only a couple hundred microseconds is not enough for the APLL
   * to lock, and the DAC clock silently falls back to a divided XTAL — the
   * DAC block appears configured but the FIFO stops draining after a few
   * words.  10 ms matches the reference bring-up.
   */

  up_mdelay(20);

  return bk7258_ana_reg_bit(BK7258_ANA_REG25_APLL_CFG,
                            ANA_REG25_SPI_TRIGGER_BIT, 0x1u, 0);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_aud_subsystem_init(void)
{
  irqstate_t flags;
  int ret = OK;

  flags = spin_lock_irqsave(&g_bk7258_aud_lock);
  if (g_bk7258_aud_subsys_ready)
    {
      spin_unlock_irqrestore(&g_bk7258_aud_lock, flags);
      return OK;
    }

  spin_unlock_irqrestore(&g_bk7258_aud_lock, flags);

  /* CP owns the shared SYS power and SRAM controls and clears them while AP
   * is held in reset.  AP must only validate that handoff: writing these
   * registers here would race CP power management through whole-word RMWs.
   * Fail closed before publishing subsystem readiness if the handoff did not
   * take effect.
   */

  {
    uint32_t power = getreg32(BK7258_SYS_POWER_WAKEUP);
    uint32_t mem_ctrl1 = getreg32(BK7258_SYS_DEV_MEM_CTRL1);
    uint32_t mem_ctrl2 = getreg32(BK7258_SYS_DEV_MEM_CTRL2);

    if ((power & BK7258_SYS_AUDP_POWER_DOWN) != 0 ||
        (mem_ctrl1 & BK7258_SYS_AUD_MEM_LOW_POWER) != 0 ||
        (mem_ctrl2 & BK7258_SYS_AUD_MEM_LOW_POWER) != 0)
      {
        auderr("BK7258: CP audio wake handoff invalid: "
               "pwr=%08lx sd=%08lx ds=%08lx\n",
               (unsigned long)power,
               (unsigned long)mem_ctrl1,
               (unsigned long)mem_ctrl2);
        return -EIO;
      }
  }

  /* §2.1 step 2/3: start from XTAL and gate the audio clock on.  The audio
   * clock mux is programmed later by bk7258_dac_configure().
   */

  bk7258_sys_reg_bits(SYS_CLK_DIV_MODE1,
                      SYS_CLK_DIV_MODE1_CKSEL_AUD_MASK
                          << SYS_CLK_DIV_MODE1_CKSEL_AUD_BIT,
                      0u);
  bk7258_sys_reg_bits(SYS_CPU_DEVICE_CLK_EN,
                      UINT32_C(1) << SYS_CPU_DEVICE_CLK_AUD_CKEN_BIT,
                      UINT32_C(1) << SYS_CPU_DEVICE_CLK_AUD_CKEN_BIT);

  /* §2.1 step 4: the AUD-block interrupt line is intentionally NOT gated
   * here.  Playback goes through GDMA; the driver does not attach any
   * handler to BK7258_IRQ_AUDIO, so leaving the sys-ctrl CPU int_en bit
   * clear avoids delivering an aggregate audio IRQ that nobody consumes.
   */

  /* §2.1 step 5: release the audio data path from reset via AUD_CLK_CONTROL.
   *
   * soft_reset is ACTIVE-LOW on this silicon: 1 = reset released (operating),
   * 0 = reset held.  AVDK's bk_aud_driver_init() does exactly
   * aud_hal_set_clk_control_soft_reset(1) and never clears bit0 until the
   * deinit path (which pulses 0->1->0 to re-assert reset).  The register
   * comment "写1复位...需要软件清除" is misleading; the reference code is the
   * ground truth.
   *
   * The earlier bring-up here pulsed bit0 1->0, leaving soft_reset=0 and so
   * HOLDING the data path in reset: the -F probe showed FIFO_STATUS staying
   * all-EMPTY across 32 rapid DAC_FPORT writes (the write port is dead in
   * reset), while ana_reg SPI writes still latched correctly (the analog SPI
   * runs on its own domain).  Leaving soft_reset=1, exactly as AVDK does,
   * restores the FIFO.
   *
   * bit1 (clk_gate) is intentionally left at its working default (0); AVDK
   * never writes it either.
   */

  putreg32(getreg32(BK7258_AUD_CLK_CONTROL) | AUD_CLK_CTRL_SOFT_RESET,
           BK7258_AUD_CLK_CONTROL);

  /* §2.1 step 6: apply the pre-computed ana_reg defaults.  These are the
   * exact values AVDK's ana_regNN_value_cal() functions produce on
   * SOC_BK7236XX; changing them alters bias current, VCM and DAC common
   * mode and MUST be re-derived from silicon test data if touched.
   */

  ret = bk7258_ana_reg_write(BK7258_ANA_REG18, BK7258_ANA_REG18_DEFAULT);
  if (ret < 0)
    {
      goto fail;
    }

  ret = bk7258_ana_reg_write(BK7258_ANA_REG19, BK7258_ANA_REG19_DEFAULT);
  if (ret < 0)
    {
      goto fail;
    }

  ret = bk7258_ana_reg_write(BK7258_ANA_REG20, BK7258_ANA_REG20_DEFAULT);
  if (ret < 0)
    {
      goto fail;
    }

  ret = bk7258_ana_reg_write(BK7258_ANA_REG21, BK7258_ANA_REG21_DEFAULT);
  if (ret < 0)
    {
      goto fail;
    }

  ret = bk7258_ana_reg_write(BK7258_ANA_REG27, BK7258_ANA_REG27_DEFAULT);
  if (ret < 0)
    {
      goto fail;
    }

  /* §2.1 step 7: enable the audio bias network AFTER the ana_reg defaults
   * have latched.
   */

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG18,
                           ANA_REG18_ENAUDBIAS_BIT, 0x1u, 1);
  if (ret < 0)
    {
      goto fail;
    }

  flags = spin_lock_irqsave(&g_bk7258_aud_lock);
  g_bk7258_aud_subsys_ready = true;
  spin_unlock_irqrestore(&g_bk7258_aud_lock, flags);

  audinfo("BK7258: audio subsystem initialised\n");
  return OK;

fail:
  auderr("BK7258: audio subsystem init failed: %d\n", ret);
  return ret;
}

