open-vela/contest2026_272_tokenwujixian/chips/bk7258/audio/bk7258_dac.c
int bk7258_dac_configure(const struct bk7258_dac_cfg_s *cfg)
{
  irqstate_t flags;
  uint32_t v;
  int ret;

  if (cfg == NULL)
    {
      return -EINVAL;
    }

  if (!g_bk7258_aud_subsys_ready)
    {
      ret = bk7258_aud_subsystem_init();
      if (ret < 0)
        {
          return ret;
        }
    }

  g_bk7258_dac_use_apll = cfg->use_apll;

  /* §2.2 clock select. */

  if (cfg->use_apll)
    {
      bk7258_sys_reg_bits(SYS_CLK_DIV_MODE1,
                          SYS_CLK_DIV_MODE1_CKSEL_AUD_MASK
                              << SYS_CLK_DIV_MODE1_CKSEL_AUD_BIT,
                          UINT32_C(1) << SYS_CLK_DIV_MODE1_CKSEL_AUD_BIT);

      ret = bk7258_apll_program(BK7258_APLL_CAL_VAL_48K);
      if (ret < 0)
        {
          return ret;
        }

      v = getreg32(BK7258_AUD_AUDIO_CONFIG);
      v |= AUD_AUDIO_CFG_APLL_SEL;
      putreg32(v, BK7258_AUD_AUDIO_CONFIG);

      /* Divide DMIC clock so it does not steal APLL bandwidth. */

      bk7258_sys_reg_bits(SYS_CLK_DIV_MODE2,
                          UINT32_C(1) << SYS_CLK_DIV_MODE2_DMIC_DIV_BIT,
                          UINT32_C(1) << SYS_CLK_DIV_MODE2_DMIC_DIV_BIT);
    }
  else
    {
      bk7258_sys_reg_bits(SYS_CLK_DIV_MODE1,
                          SYS_CLK_DIV_MODE1_CKSEL_AUD_MASK
                              << SYS_CLK_DIV_MODE1_CKSEL_AUD_BIT,
                          0u);

      v = getreg32(BK7258_AUD_AUDIO_CONFIG);
      v &= ~AUD_AUDIO_CFG_APLL_SEL;
      putreg32(v, BK7258_AUD_AUDIO_CONFIG);
    }

  /* §2.3 step 4: DAC analog path power-up.  On BK7258 (SOC_BK7236XX) the
   * BK7256-era right-channel/vdd rails are not-supported no-ops in AVDK;
   * we only drive the fields that actually map to silicon.
   *
   *   dac_bias_en  → ana_reg21[enbs]        (not exposed here, latched by
   *                                          the ana_reg21 default value)
   *   dac_drv_en   → ana_reg20[dacdrven]
   *   dac_dcoc_en  → ana_reg20[lendcoc]
   *   dac_idac_en  → ana_reg21[enidacl]
   *   dacl_en      → ana_reg20[daclen]
   *   diffen       → ana_reg20[diffen]
   */

  /* AVDK aud_dac_driver.c:81..87 explicitly flips these four bits in this
   * order.  ana_reg21.enbs (dac bias) is NOT part of the reset default
   * value we programmed earlier and MUST be raised now.
   */

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG21,
                           ANA_REG21_ENBS_BIT, 0x1u, 1);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG20,
                           ANA_REG20_DACDRVEN_BIT, 0x1u, 1);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG20,
                           ANA_REG20_LENDCOC_BIT, 0x1u, 1);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG21,
                           ANA_REG21_ENIDACL_BIT, 0x1u, 1);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG20,
                           ANA_REG20_DACLEN_BIT, 0x1u, 1);
  if (ret < 0)
    {
      return ret;
    }

  /* §2.3 step 6: differential vs single-ended. */

  ret = bk7258_ana_reg_bit(BK7258_ANA_REG20,
                           ANA_REG20_DIFFEN_BIT, 0x1u,
                           cfg->work_mode == BK7258_DAC_WORK_DIFFEN
                                             ? 1u : 0u);
  if (ret < 0)
    {
      return ret;
    }

  /* §2.3 step 7: DAC digital path.  Gain, HPF bypass, clk invert. */

  flags = spin_lock_irqsave(&g_bk7258_aud_lock);
  v = getreg32(BK7258_AUD_DAC_CONFIG0);
  v &= ~(AUD_DAC_CFG0_GAIN_MASK | AUD_DAC_CFG0_CLK_INVERT
         | AUD_DAC_CFG0_HPF1_BYPASS | AUD_DAC_CFG0_HPF2_BYPASS);
  v |= ((uint32_t)(cfg->gain & 0x3Fu) << AUD_DAC_CFG0_GAIN_SHIFT);
  v |= AUD_DAC_CFG0_HPF1_BYPASS | AUD_DAC_CFG0_HPF2_BYPASS;
  putreg32(v, BK7258_AUD_DAC_CONFIG0);
  spin_unlock_irqrestore(&g_bk7258_aud_lock, flags);

  /* §2.4: FIFO read threshold.  With threshold=0 the audio block only
   * asserts a DMA request when the FIFO is completely empty; on a 32-word
   * FIFO that is one request per 32 samples, and combined with any DMA
   * arbitration latency the FIFO under-runs and stops requesting.  AVDK
   * uses 4 for BK7256; 8 leaves comfortable headroom on BK7258.
   */

  {
    uint32_t fifo_cfg;
    fifo_cfg  = getreg32(BK7258_AUD_FIFO_CONFIG);
    fifo_cfg &= ~(AUD_FIFO_CFG_DACL_RD_TH_MASK
                  | AUD_FIFO_CFG_DACR_RD_TH_MASK);
    fifo_cfg |= (UINT32_C(8) << AUD_FIFO_CFG_DACL_RD_TH_SHIFT);
    fifo_cfg |= (UINT32_C(8) << AUD_FIFO_CFG_DACR_RD_TH_SHIFT);
    putreg32(fifo_cfg, BK7258_AUD_FIFO_CONFIG);
  }

  /* §2.3 step 8: sample-rate divider. */

  ret = bk7258_dac_set_sample_rate(cfg->samp_rate);
  if (ret < 0)
    {
      return ret;
    }

  /* §2.3 step 9: previously we muted the DAC here.  Empirically the DAC
   * FIFO then never fully drains after start() unmutes; leaving the DAC
   * un-muted through configure() lets DMA replenish the FIFO immediately.
   */

  g_bk7258_dac_configured = true;
  return OK;
}

int bk7258_dac_set_sample_rate(uint32_t samp_rate)
{
  uint32_t sr_code;
  uint32_t fracmod = 0;
  bool     fracmod_manual = false;
  bool     apll_44k_family = false;
  uint32_t v;
  int ret;

  switch (samp_rate)
    {
      case 8000:
        sr_code = AUD_SAMP_RATE_8K;
        break;

      case 16000:
        sr_code = AUD_SAMP_RATE_16K;
        break;

      case 44100:
        sr_code = AUD_SAMP_RATE_44_1K;
        apll_44k_family = true;
        break;

      case 48000:
        sr_code = AUD_SAMP_RATE_48K;
        break;

      case 11025:
        sr_code = AUD_SAMP_RATE_44_1K;
        fracmod = BK7258_AUD_CONST_DIV_44_1K << 2;
        fracmod_manual = true;
        apll_44k_family = true;
        break;

      case 22050:
        sr_code = AUD_SAMP_RATE_44_1K;
        fracmod = BK7258_AUD_CONST_DIV_44_1K << 1;
        fracmod_manual = true;
        apll_44k_family = true;
        break;

      case 12000:
        sr_code = AUD_SAMP_RATE_48K;
        fracmod = BK7258_AUD_CONST_DIV_48K << 2;
        fracmod_manual = true;
        break;

