open-vela/contest2026_272_tokenwujixian/chips/bk7258/audio/bk7258_dac.c
      case 24000:
        sr_code = AUD_SAMP_RATE_48K;
        fracmod = BK7258_AUD_CONST_DIV_48K << 1;
        fracmod_manual = true;
        break;

      case 32000:
        sr_code = AUD_SAMP_RATE_16K;
        fracmod = BK7258_AUD_CONST_DIV_16K >> 1;
        fracmod_manual = true;
        break;

      default:
        auderr("BK7258: unsupported sample rate %lu\n",
               (unsigned long)samp_rate);
        return -EINVAL;
    }

  /* On APLL, the 44.1k family requires a different cal value.  Re-run the
   * APLL bring-up transparently.
   */

  if (g_bk7258_dac_use_apll)
    {
      ret = bk7258_apll_program(apll_44k_family
                                    ? BK7258_APLL_CAL_VAL_44_1K
                                    : BK7258_APLL_CAL_VAL_48K);
      if (ret < 0)
        {
          return ret;
        }
    }

  /* Program fracmod first (upper half), then the samp_rate_DAC bits.  This
   * mirrors AVDK ordering and avoids a transient rate mismatch on the DAC
   * clock.
   */

  v = getreg32(BK7258_AUD_EXTEND_CFG);
  v &= ~AUD_EXT_CFG_DAC_FRACMOD_MAN;
  if (fracmod_manual)
    {
      v |= AUD_EXT_CFG_DAC_FRACMOD_MAN;
    }

  putreg32(v, BK7258_AUD_EXTEND_CFG);

  if (fracmod_manual)
    {
      putreg32(fracmod, BK7258_AUD_DAC_FRACMOD);
    }

  v = getreg32(BK7258_AUD_AUDIO_CONFIG);
  v &= ~AUD_AUDIO_CFG_SAMP_RATE_MASK;
  v |= (sr_code << AUD_AUDIO_CFG_SAMP_RATE_SHIFT)
       & AUD_AUDIO_CFG_SAMP_RATE_MASK;
  putreg32(v, BK7258_AUD_AUDIO_CONFIG);

  return OK;
}

void bk7258_dac_set_gain(uint8_t gain)
{
  irqstate_t flags;
  uint32_t v;

  if (gain > 0x3Fu)
    {
      gain = 0x3Fu;
    }

  flags = spin_lock_irqsave(&g_bk7258_aud_lock);
  v = getreg32(BK7258_AUD_DAC_CONFIG0);
  v &= ~AUD_DAC_CFG0_GAIN_MASK;
  v |= ((uint32_t)gain << AUD_DAC_CFG0_GAIN_SHIFT);
  putreg32(v, BK7258_AUD_DAC_CONFIG0);
  spin_unlock_irqrestore(&g_bk7258_aud_lock, flags);
}

int bk7258_dac_mute(bool mute)
{
  return bk7258_ana_reg_bit(BK7258_ANA_REG20,
                            ANA_REG20_DACMUTE_BIT, 0x1u,
                            mute ? 1u : 0u);
}

void bk7258_dac_start(void)
{
  irqstate_t flags;
  uint32_t v;

  flags = spin_lock_irqsave(&g_bk7258_aud_lock);
  v = getreg32(BK7258_AUD_AUDIO_CONFIG);
  v |= AUD_AUDIO_CFG_DAC_ENABLE;
  putreg32(v, BK7258_AUD_AUDIO_CONFIG);
  spin_unlock_irqrestore(&g_bk7258_aud_lock, flags);
}

void bk7258_dac_stop(void)
{
  irqstate_t flags;
  uint32_t v;

  flags = spin_lock_irqsave(&g_bk7258_aud_lock);
  v = getreg32(BK7258_AUD_AUDIO_CONFIG);
  v &= ~AUD_AUDIO_CFG_DAC_ENABLE;
  putreg32(v, BK7258_AUD_AUDIO_CONFIG);
  spin_unlock_irqrestore(&g_bk7258_aud_lock, flags);
}

uintptr_t bk7258_dac_fifo_addr(void)
{
  return (uintptr_t)BK7258_AUD_DAC_FPORT;
}

void bk7258_dac_fifo_write(uint32_t pcm_word)
{
  putreg32(pcm_word, BK7258_AUD_DAC_FPORT);
}

void bk7258_dac_reset_data_path(void)
{
  irqstate_t flags;

  /* soft_reset is active-low (1 = reset released, 0 = reset held), so a
   * data-path reset is a 0 -> 1 pulse that ends back in the operating state.
   * Never write clk_gate (bit1) — AVDK leaves it at its working default (0).
   */
  flags = spin_lock_irqsave(&g_bk7258_aud_lock);
  putreg32(getreg32(BK7258_AUD_CLK_CONTROL) & ~AUD_CLK_CTRL_SOFT_RESET,
           BK7258_AUD_CLK_CONTROL);
  up_udelay(10);
  putreg32(getreg32(BK7258_AUD_CLK_CONTROL) | AUD_CLK_CTRL_SOFT_RESET,
           BK7258_AUD_CLK_CONTROL);
  g_bk7258_dac_configured = false;
  spin_unlock_irqrestore(&g_bk7258_aud_lock, flags);
}

bool bk7258_dac_fifo_needs_data(void)
{
  const uint32_t st = getreg32(BK7258_AUD_FIFO_STATUS);

  /* Return true when either channel drops below the read-threshold; the
   * caller should replenish enough data to bring both above threshold.
   */

  return (st & (AUD_FIFO_ST_DACL_NEAR_EMPTY
                | AUD_FIFO_ST_DACR_NEAR_EMPTY)) != 0u;
}

void bk7258_dac_deinit(void)
{
  uint32_t v;

  bk7258_dac_stop();
  (void)bk7258_dac_mute(true);

  /* Reverse the analog power-up sequence.  Keep the ana_reg defaults in
   * place so a future bk7258_dac_configure() does not have to re-run the
   * whole subsystem init.
   */

  (void)bk7258_ana_reg_bit(BK7258_ANA_REG20, ANA_REG20_DACLEN_BIT, 0x1u, 0);
  (void)bk7258_ana_reg_bit(BK7258_ANA_REG21, ANA_REG21_ENIDACL_BIT, 0x1u, 0);
  (void)bk7258_ana_reg_bit(BK7258_ANA_REG20, ANA_REG20_LENDCOC_BIT, 0x1u, 0);
  (void)bk7258_ana_reg_bit(BK7258_ANA_REG20, ANA_REG20_DACDRVEN_BIT, 0x1u, 0);

  /* Restore the vendor deinit clock baseline: select XTAL in both the SYS
   * mux and AUD block, clear the APLL-only DMIC divider, then power APLL
   * down.  This makes the next configure independent of the previous one.
   */

  v = getreg32(BK7258_AUD_AUDIO_CONFIG);
  v &= ~AUD_AUDIO_CFG_APLL_SEL;
  putreg32(v, BK7258_AUD_AUDIO_CONFIG);
  bk7258_sys_reg_bits(SYS_CLK_DIV_MODE1,
                      SYS_CLK_DIV_MODE1_CKSEL_AUD_MASK
                          << SYS_CLK_DIV_MODE1_CKSEL_AUD_BIT,
                      0u);
  bk7258_sys_reg_bits(SYS_CLK_DIV_MODE2,
                      UINT32_C(1) << SYS_CLK_DIV_MODE2_DMIC_DIV_BIT,
                      0u);
  (void)bk7258_ana_reg_bit(BK7258_ANA_REG_APLL_PWD,
                           ANA_REG5_PWDAUDPLL_BIT, 0x1u, 1u);

  g_bk7258_dac_use_apll  = false;
  g_bk7258_dac_configured = false;
}

void bk7258_dac_get_stats(struct bk7258_dac_stats_s *out)
{
  if (out == NULL)
    {
      return;
    }

  out->version_id         = getreg32(BK7258_AUD_VERSION_ID);
  out->global_status      = getreg32(BK7258_AUD_GLOBAL_STATUS);
  out->audio_config       = getreg32(BK7258_AUD_AUDIO_CONFIG);
  out->fifo_config        = getreg32(BK7258_AUD_FIFO_CONFIG);
  out->fifo_status        = getreg32(BK7258_AUD_FIFO_STATUS);
  out->dac_config0        = getreg32(BK7258_AUD_DAC_CONFIG0);
  out->extend_cfg         = getreg32(BK7258_AUD_EXTEND_CFG);
  out->clk_control        = getreg32(BK7258_AUD_CLK_CONTROL);
  out->sys_clk_div_mode1  = getreg32(SYS_CLK_DIV_MODE1);
  out->sys_clk_div_mode2  = getreg32(SYS_CLK_DIV_MODE2);
  out->device_clk_enable  = getreg32(SYS_CPU_DEVICE_CLK_EN);
  out->device_mem_ctrl1   = getreg32(BK7258_SYS_DEV_MEM_CTRL1);
  out->device_mem_ctrl2   = getreg32(BK7258_SYS_DEV_MEM_CTRL2);
  out->power_sleep_wakeup = getreg32(BK7258_SYS_POWER_WAKEUP);
  out->analog_spi_state   = getreg32(BK7258_SYS_ANA_SPI_STATE);
  out->ana_reg5           = getreg32(BK7258_SYS_ANA_REG(BK7258_ANA_REG_APLL_PWD));
  out->ana_reg18          = getreg32(BK7258_SYS_ANA_REG(BK7258_ANA_REG18));
  out->ana_reg19          = getreg32(BK7258_SYS_ANA_REG(BK7258_ANA_REG19));
  out->ana_reg20          = getreg32(BK7258_SYS_ANA_REG(BK7258_ANA_REG20));
  out->ana_reg21          = getreg32(BK7258_SYS_ANA_REG(BK7258_ANA_REG21));
  out->ana_reg25          = getreg32(BK7258_SYS_ANA_REG(BK7258_ANA_REG25_APLL_CFG));
  out->ana_reg26          = getreg32(BK7258_SYS_ANA_REG(BK7258_ANA_REG26_APLL_CAL));
  out->ana_reg27          = getreg32(BK7258_SYS_ANA_REG(BK7258_ANA_REG27));
}
